{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "6400"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/Cast", "op": "Cast", "input": ["inputs"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/Cast", "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/convolution", "StatefulPartitionedCall/sequential_1/conv2d_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1/Cast", "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1/Cast_5"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool2d", "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution", "StatefulPartitionedCall/sequential_1/conv2d_1_2/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1_2/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1_2/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1_2/Cast", "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1_2/Cast_5"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d", "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution", "StatefulPartitionedCall/sequential_1/conv2d_2_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_2_1/Cast", "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_2_1/Cast_5"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_2_1/MaxPool2d", "StatefulPartitionedCall/sequential_1/conv2d_3_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_3_1/convolution", "StatefulPartitionedCall/sequential_1/conv2d_3_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_3_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/conv2d_3_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_3_1/Cast", "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_3_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_3_1/Cast_5"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_3_1/MaxPool2d", "StatefulPartitionedCall/sequential_1/conv2d_4_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4_1/convolution", "StatefulPartitionedCall/sequential_1/conv2d_4_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_4_1/Cast", "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_4_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_4_1/Cast_5"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_4_1/MaxPool2d", "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_HALF"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/sequential_1/dense_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/dense_1/MatMul", "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/Cast_1", "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/Cast", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/Cast", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1_2/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/Cast", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_2_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3_1/convolution/Cast", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_3_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_3_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4_1/convolution/Cast", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/Cast", "shape": [6400, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/Cast", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [512, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}]}]}